spec/fixtures/files/stripe_api/successful_customer.json

{
  "id":"cus_F9N5Afwo5Mf09z",
  "object":"customer",
  "account_balance":0,
  "address":null,
  "created":1559046246,
  "currency":null,
  "default_source":"card_1Ef4K9ESypPNvvdYbp981tt2",
  "delinquent":false,
  "description":"Customer for food@example.com",
  "discount":null,
  "email":null,
  "invoice_prefix":"38539E0C",
  "invoice_settings":{
    "custom_fields":null,
    "default_payment_method":null,
    "footer":null
  },
  "livemode":false,
  "metadata":{

  },
  "name":null,
  "phone":null,
  "preferred_locales":[

  ],
  "shipping":null,
  "sources":{
    "object":"list",
    "data":[  
      {
        "id":"card_1Ef4K9ESypPNvvdYbp981tt2",
        "object":"card",
        "address_city":null,
        "address_country":null,
        "address_line1":null,
        "address_line1_check":null,
        "address_line2":null,
        "address_state":null,
        "address_zip":"42424",
        "address_zip_check":"pass",
        "brand":"Visa",
        "country":"US",
        "customer":"cus_F9N5Afwo5Mf09z",
        "cvc_check":"pass",
        "dynamic_last4":null,
        "exp_month":4,
        "exp_year":2024,
        "fingerprint":"T2uFyKFk6S4ZKA7e",
        "funding":"credit",
        "last4":"4242",
        "metadata":{  

        },
        "name":null,
        "tokenization_method":null
      }
    ],
    "has_more":false,
    "total_count":1,
    "url":"/v1/customers/cus_F9N5Afwo5Mf09z/sources"
  },
  "subscriptions":{  
    "object":"list",
    "data":[  

    ],
    "has_more":false,
    "total_count":0,
    "url":"/v1/customers/cus_F9N5Afwo5Mf09z/subscriptions"
  },
  "tax_exempt":"none",
  "tax_ids":{  
    "object":"list",
    "data":[  

    ],
    "has_more":false,
    "total_count":0,
    "url":"/v1/customers/cus_F9N5Afwo5Mf09z/tax_ids"
  },
  "tax_info":null,
  "tax_info_verification":null
}